* McDowell (2020) 15E
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | mcdowell_2021_15e
Alternate name                        | 
Data source                           |  McDowell, I. E., Humphrey, N. F., Harper, J. T., and Meierbachtol, T. W.: The cooling signature of basal crevasses in a hard-bedded region of the Greenland Ice Sheet, The Cryosphere, 15, 897–907, https://doi.org/10.5194/tc-15-897-2021, 2021.
Drill year(s)                         | 2015
Data year(s)                          | August 2016
Longitude [°E]                        | -49.56402498
Latitude [°N]                         | 67.18186604
Approximate location name             | 
Location source                       | 
Ice thickness [m]                     | 665
Ice thickness year                    | 2015
Ice thickness source                  | See raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder
Surface velocity [m yr^-1]            | 
Surface velocity year                 | 
Surface velocity source               | 
Measured from: Top, Bottom, Relative  | B
Depth of top measurement [m]          | 40
Depth of bottom measurement [m]       | 660
#+end_example

** Temperature

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Thickness

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)
 
** Location

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :exports none
import numpy as np
import pandas as pd

df_bot = pd.read_csv("meta.bsv", sep="|", index_col=0, header=None, squeeze=True)
thick = np.float(df_bot['Ice thickness [m]'])
df = pd.read_csv('data_bottom.csv')
df = df[df.columns[::-1]]  # swap from d,t to t,d
df['d'] = thick - df['d']
df.to_csv('data.csv', index=False)
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k2
#+END_SRC

#+RESULTS:
|                   t |     d |
|      -10.9641274792 |  40.0 |
| -11.164941218800001 |  60.0 |
| -11.365754958399998 |  80.0 |
|       -11.566568698 | 100.0 |
|      -11.6423824376 | 120.0 |
| -11.905696177200001 | 140.0 |
|      -11.9190099168 | 160.0 |
| -11.994823656400001 | 180.0 |
| -12.133137395999999 | 200.0 |
|      -12.2089511356 | 220.0 |
|      -12.0972648752 | 240.0 |
|      -12.1730786148 | 260.0 |
|      -12.0613923544 | 280.0 |
| -11.949706094000001 | 300.0 |
| -11.775519833599999 | 320.0 |
|      -11.6013335732 | 340.0 |
| -10.989647312799999 | 360.0 |
|      -10.7529610524 | 380.0 |
|       -10.578774792 | 400.0 |
|      -10.2170885316 | 420.0 |
|  -9.730402271200001 | 440.0 |
|       -9.2437160108 | 460.0 |
|       -8.6320297504 | 480.0 |
|         -7.95784349 | 500.0 |
|       -7.2836572296 | 520.0 |
|  -6.852814099400001 | 530.0 |
|  -6.421970969199999 | 540.0 |
|        -5.991127839 | 550.0 |
|       -5.6227847088 | 560.0 |
|       -5.1919415786 | 570.0 |
|  -4.698598448399999 | 580.0 |
|       -4.2677553182 | 590.0 |
| -3.7744121880000003 | 600.0 |
|       -3.3435690578 | 610.0 |
|       -2.8502259276 | 620.0 |
|       -2.3568827974 | 630.0 |
|       -1.8010396672 | 640.0 |
| -1.4326965369999998 | 650.0 |
| -0.9393534068000001 | 660.0 |

